It-academy/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

It-academy/AccumulationRegisters/СтоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

It-academy/CommonModules/РаботаСДокументамиСервер/Ext/Module.bsl
&НаСервере
Функция ПолучитьСреднююЦенуДляТаблицыНоменклатур(Дата, ТаблицаНоменклатур) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
	|		Таблица.Номенклатура КАК Номенклатура,
	|		Таблица.ВидНоменклатуры КАК ВидНоменклатуры,
	|		Таблица.СчетДт КАК СчетДт,
	|		Таблица.СчетКт КАК СчетКт,
	|		Таблица.Количество КАК Количество,
	|		Таблица.Сумма КАК Сумма
	|ПОМЕСТИТЬ втНоменклатуры
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////
	|ВЫБРАТЬ
	|	втНоменклатуры.Номенклатура КАК Номенклатура,
	|	втНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры,
	|	втНоменклатуры.СчетДт КАК СчетДт,
	|	втНоменклатуры.СчетКт КАК СчетКт,   
	|	втНоменклатуры.Количество КАК Количество,
	|	втНоменклатуры.Сумма КАК Сумма, 
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СтоимостьТоваровОстатки.СтоимостьОстаток, 0) /
	|				ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК Стоимость
	|ИЗ
	|	втНоменклатуры КАК втНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, ) КАК ТоварыНаСкладахОстатки
	|		ПО втНоменклатуры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьТоваров.Остатки(&Дата, ) КАК СтоимостьТоваровОстатки
	|		ПО втНоменклатуры.Номенклатура = СтоимостьТоваровОстатки.Номенклатура";  
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаНоменклатур);
	Запрос.УстановитьПараметр("Дата",Дата);
	
	Возврат Запрос.Выполнить();
	
КонецФункции  

Функция ПроверкаОстатковТоваров(Дата, Склад, СписокНоменклатур) Экспорт
	  
	  Результат = Истина;
	  
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|		&Дата,
		|		Склад = &Склад
		|			И Номенклатура В(&СписокНоменклатур)) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|ТоварыНаСкладахОстатки.КоличествоОстаток < 0";

	
    Запрос.УстановитьПараметр("Склад", Склад);
    Запрос.УстановитьПараметр("Дата",Новый Граница (Дата, ВидГраницы.Включая));
    Запрос.УстановитьПараметр("СписокНоменклатур", СписокНоменклатур);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Ложь;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не хватает " + "" + Строка (-Выборка.КоличествоОстаток)
		+ "Единиц " + Выборка.Номенклатура;
		Сообщение.Сообщить();
КонецЦикла;		
    Возврат Результат;
    
КонецФункции
